tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/filter/0.org/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1;
        value           uniform 0;
    }
    inlet
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    cycLeft
    {
        type            cyclic;
        value           uniform 0;
    }
    cycRight
    {
        type            cyclic;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
